# 一、单变量赋值
x = 10  # 整数类型
y = "张三"  # 字符串类型
o = 3.14  # 浮点数类型
p = False  # 布尔类型
z = [1, 2, 3, 4]  # 数组(列表)类型 后面会讲到
a = {'name': '李四', 'age': 19}  # 字典类型 后面会讲到
b = {'北京', '上海', '广州', '深圳'}  # 集合类型 后面会讲到

# 二、多目标赋值(链式赋值)
aa = bb = 10  # 整数类型
print(aa, bb)

# 三、解包赋值
# 3.1 列表解包
# 列表解包
a, b, c = [1,2,3]  # a=1, b=2, c=3
print(a,b,c)
#3.2元组解包（元组可以省略括号，最常用）
# 等价于m,n=(100,200)，Python经典写法
x, y = (10, 20)
m, n = 100, 200
print(m, n)
#不同的数据类型。
cc, dd = 10, '30'
print(aa, bb)
#3.3 字符串解包（按字符拆分）
s1, s2 = "py"      # s1="p", s2="y"
print(s1,s2)

#四、星号解包（*，变量数 ≠ 元素数，批量接收剩余元素）
# 左侧少变量：*接收尾部剩余元素
a, *b = [1,2,3,4]  # a=1, b=[2,3,4]
*a, b = [1,2,3,4]  # a=[1,2,3], b=4
a, *b, c = [1,2,3,4]  # a=1, b=[2,3], c=4

# 字符串/元组的星号解包
*s, = "python"  # s=['p','y','t','h','o','n']（单独*变量需加逗号，避免被识别为普通变量
print(s)

# 五、设置变量空值
cc = None
print(cc)  # None
