#类表元素的排序

#1、sort方法
lst=[20,40,10,98,54]
print('排序前的列表',lst,id(lst))#排序前的列表 [20, 40, 10, 98, 54] 34243624

#sort,默认升序
lst.sort()
print('排序后的列表',lst,id(lst))#排序后的列表 [10, 20, 40, 54, 98] 34243624

#降序
lst.sort(reverse=True)
print('降序',lst,id(lst))#升序 [98, 54, 40, 20, 10] 28869640
#升序
lst.sort(reverse=False)
print('降序',lst,id(lst))#降序 [10, 20, 40, 54, 98] 28869640

print("=====================================================内置函数==================================================")
lst=[20,90,40,50,60]
print("原列表",lst)#原列表 [20, 90, 40, 50, 60]
#产生新类表对象
new_list = sorted(lst)
print("新列表",new_list)#新列表 [20, 40, 50, 60, 90]


